Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_СпособыДоставкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СпособыДоставкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = 0 Тогда
		ПроверяемыеРеквизиты.Очистить();
	Иначе
		РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие);
		Если РеквизитыСобытия.ИсточникСобытия <> Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
			ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ДатаОтправки");
			Если ИндексЭлемента <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОтправки = Неопределено;
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка пометки удаления
	Если Не ЭтоНовый() И Статус <> 0 Тогда
		Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
			Статус = 0;
		КонецЕсли;
	КонецЕсли;
	
	ИсточникСобытия = Неопределено;
	Если ЗначениеЗаполнено(Событие) Тогда
		ИсточникСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие).ИсточникСобытия;
	КонецЕсли;
	
	ОтправкаВручную = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтправкаВручную") Тогда
		ОтправкаВручную = ДополнительныеСвойства.ОтправкаВручную;
	КонецЕсли;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка
		И Статус = 1
		И Не ОтправкаВручную Тогда
		
		// Создание регламентного задания (получение уникального идентификатора)
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание = Неопределено Тогда
			
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ПЛ_УведомленияПоРегламентнымПроверкам);
			Задание.Использование = Истина;
			Задание.Наименование = ПЛ_УведомленияОСобытиях.ПодставитьПараметрыВСтроку(НСтр("ru = 'Рассылка %1 по группе %2'"), Ссылка, Событие);
			
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ДатаНачала = ДатаОтправки;
			Расписание.ВремяНачала = ДатаОтправки;
			
			Задание.Расписание = Расписание;
			Задание.Записать();
			
			РегламентноеЗадание = Задание.УникальныйИдентификатор;
			
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			Задание.Удалить();
		КонецЕсли;
		
		РегламентноеЗадание = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭлПочта = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта);
	СервисПочтовойРассылки = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки);
	СМС = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС);
	Напоминание = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение);
	
	ОтправкаВручную = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтправкаВручную") Тогда
		ОтправкаВручную = ДополнительныеСвойства.ОтправкаВручную;
	КонецЕсли;
	
	РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие);
	
	Если РеквизитыСобытия.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка
		И Статус = 1
		И Не ОтправкаВручную
		И ЗначениеЗаполнено(ДатаОтправки) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			
			ЗаданиеИзменено = Ложь;
			
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ДатаНачала = ДатаОтправки;
			Расписание.ВремяНачала = ДатаОтправки;
			
			Если Строка(Расписание) <> Строка(Задание.Расписание) Тогда
				Задание.Расписание = Расписание;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			НаименованиеЗадания = ПЛ_УведомленияОСобытиях.ПодставитьПараметрыВСтроку(НСтр("ru = 'Рассылка %1 по группе %2'"), Ссылка, Событие);
			Если Задание.Наименование <> НаименованиеЗадания Тогда
				Задание.Наименование = НаименованиеЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Задание.Использование <> Булево(Статус) Тогда
				Задание.Использование = Статус;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Задание.Параметры.Количество() <> 1 Или Задание.Параметры[0] <> Событие Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка.Событие);
				ПараметрыЗадания.Добавить(Ссылка);
				Задание.Параметры = ПараметрыЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если ЗаданиеИзменено Тогда
				Задание.Записать();
			КонецЕсли;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
